var express = require('express');
var router = express.Router();
var _ = require("../helpers/_");


router.get('/', function (req, res, next) {
    return res.render('rules', {title: "قوانین"});
});


router.post('/rules', function (req, res, next) {

    var rules = {};

    rules.aboutGames = "اگر می خواهی در لیگ روزانه وارد شوی، باید اول در سایت ثبت نام کنی. این کار کمتر از یک دقیقه زمان می برد .<br>" +
        "حالا وارد بازی شو. بازی ها هر روز از ساعت 9 صبح تا 9 شب برگزار میشود.<br>" +
        "هر برد در بازی دوز ۱ امتیاز - نقطه و خط ۲ امتیاز و کارت حافظه ۳ امتیاز دارد<br>" +
        "به بازی کردن ادامه بده. تا ساعت 9 شب ، کسی که بیشترین برد را کسب کرده باشد بدون دشواری 100 هزار تومن را از آن خود خواهد کرد .<br>" +
        "اینکه در رقابت با بقیه ی اعضاء در کجای جدول رده بندی قرار داری را می توانی از اینجا ببینی.<br>" +
        "آماده ای ! وارد شو که هر دقیقه بازی کردن بیشتر یعنی یک گام برداشتن به سوی جایزه";

    rules.games = [];
    rules.games.push({
        gameType: 'xo',
        title: 'دوز ساده',
        description: 'توی این بازی اگر زودتر از حریفت یک ردیف (ستونی، سطری و یا ضربدری) رو پر کنی برنده می شی.'
    });

    rules.games.push({
        gameType: 'dot',
        title: "نقطه-خط",
        description: 'اگر بتونی مربع های بیشتری درست کنی برنده می شی و امتیاز می گیری.'
    });

    rules.games.push({
        gameType: 'card',
        title: 'کارت حافظه',
        description: 'اگر بتونی کارتهای شبیه به هم بیشتری پیدا کنی یک امتیاز میگیری.'
    });

    rules.games.push({
        gameType: 'battleship',
        title: 'کشتی جنگی',
        description: 'در این بازی باید اول کشتی هایت را در صفحه بچینی و بعد از اینکه چیدی شروع کنی با حریفت بازی کنی. در هر نوبت بازی یه خونه از صفحه حریفت رو انتخاب می کنی و موشک شلیک می کنی. اگر حریفت در اون نقطه کشتی اش را قرار داده بود موشکت بهش برخورد می کنه و اگر تمام خونه های کشتی حریفت رو بزنی، کشتی اش غرق میشه. هر کدوم زودتر همه کشتی های حریفش رو غرق کنه برنده میشه'
    });


    return res.json({
        result: true,
        data: rules
    });
});

module.exports = router;
